In [14]:
import pandas as pd

In [15]:
df = pd.read_csv("titanic.csv")

In [16]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [17]:
sample_row = df.iloc[100]
print(sample_row)

PassengerId                        101
Survived                             0
Pclass                               3
Name           Petranec, Miss. Matilda
Sex                             female
Age                               28.0
SibSp                                0
Parch                                0
Ticket                          349245
Fare                            7.8958
Cabin                              NaN
Embarked                             S
Name: 100, dtype: object

In [18]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [29]:
sample_row = df.iloc[527]
print(sample_row)

PassengerId                   528
Survived                        0
Pclass                          1
Name           Farthing, Mr. John
Sex                          male
Age                           NaN
SibSp                           0
Parch                           0
Ticket                   PC 17483
Fare                     221.7792
Cabin                         C95
Embarked                        S
Name: 527, dtype: object

In [20]:
df.loc[5,"Age"] = 28

In [21]:
count = 0
for person in df["Age"]:
    if person > 18:
        count = count + 1
count

576

In [22]:
count = (df["Age"] > 18).sum()

In [23]:
count = 0
for person in df ["Sex"]:
    if person == "male":
        count = count + 1
        
count = (count / len(df)) * 100
count

64.75869809203144

In [24]:
count = 0
for person in df ["Embarked"]:
    if person == "S":
        count = count + 1
        
count = (count / len(df)) * 100
count

72.27833894500561

In [25]:
count = 0
for person in df ["Embarked"]:
    if person == "C":
        count = count + 1
        
count = (count / len(df)) * 100
count

18.855218855218855

In [26]:
count = 0
for person in df ["Embarked"]:
    if person == "Q":
        count = count + 1
        
count = (count / len(df)) * 100
count

8.641975308641975

In [27]:
classes = {"CLASS":[], "Frequency":[]}
countFirst = 0
countSecond = 0
countThird = 0
for Ticket in df["Pclass"]:
    if Ticket == 1:
        countFirst = countFirst + 1
    elif if Ticket == 2:
        countSecond = countSecond

SyntaxError: invalid syntax (3453448502.py, line 8)

In [34]:
df[df['Name'] == "Fannie"]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [ ]:
idx = 0
for person is df ["name"]